// 输出二维数组的有关数据
#include <stdio.h>
int main(void)
{
    int a[3][4] = {1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23};
    printf("%d,%d\n", a, *a);                    // 0 行首地址和 0 行 0 列元素地址
    printf("%d,%d\n", a[0], *(a + 0));           // 0 行 0 列元素地址
    printf("%d,%d\n", &a[0], &a[0][0]);          // 0 行首地址和 0 行 0 列元素地址
    printf("%d,%d\n", a[1], a + 1);              // 1 行 0 列元素地址和 1 行首地址
    printf("%d,%d\n", &a[1][0], *(a + 1) + 0);   // 1 行 0 列元素地址
    printf("%d,%d\n", a[2], *(a + 2));           // 2 行 0 列元素地址
    printf("%d,%d\n", &a[2], a + 2);             // 2 行首地址
    printf("%d,%d\n", a[1][0], *(*(a + 1) + 0)); // 1 行 0 列元素的值
    printf("%d,%d\n", *a[2], *(*(a + 2) + 0));   // 2 行 0 列元素的值
    return 0;
}